The Little Clojurian

*** (hint, not a seq)
#+BEGIN_SRC clojure :session
(def atom? 
  (fn [x] 
    (not (seq? x))))
#+END_SRC
#+RESULTS:
: #'user/atom?
*** (hint, lists are flexible)
#+BEGIN_SRC clojure :session
(def sexp?
  (fn [x]
    (or (seq? x) (atom? x))))
#+END_SRC
#+RESULTS:
: #'user/sexp?
